def one_family():
    families = {('сидоров', 'сидорова'): [['Сидоров Никита', 35], ['Сидорова Алина', 34], ['Сидоров Павел', 10]],
                ('иванов', 'иванова'): [['Иванов Павел', 18], ['Иванова Надежда', 19], ['Иванов Андрей', 20]],
                ('петров', 'петрова'): [['Петров Иван', 30], ['Петрова Светлана', 31], ['Петров Сергей', 32]]}

    surname = input('Введите фамилию: ')
    print()

    for family in families:
        if surname.lower() in family:
            for people in families[family]:
                print(people[0], people[1])


one_family()
